"""
Внимательно прочитайте код в этом файле и добавьте свой код везде, где встречается <YOUR CODE>.
Перед каждым заданием вы можете прочитать его описание, помеченное меткой TODO.
для проверки введите из папки с проектом: pytest -vm task_9
"""
from typing import Any, Union, Optional


class YourClass:

    def __init__(self):
        # TODO: Создайте атрибут экземпляра data, при своем создании ссылающийся на пустой список
        "<YOUR CODE>"

    def concat(self) -> str:
        """функция объединения элементов в одну строку.
        :return: строка из эленмтов
        """

        # TODO: Запишите все элементы списка data в одну текстовую строку, разделив их между собой по пробелу.
        #  Верните эту строку как результат метода.

        "<YOUR CODE>"
